tutorials/heatTransfer/chtMultiRegionFoam/coolingCylinder2D/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(k)         $limited;
    grad(omega)     $limited;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss linearUpwind limited;

    turbulence          Gauss limitedLinear 1;
    div(phi,k)          $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,e)          $turbulence;
    div(phi,K)          $turbulence;
    div(phi,(p|rho))    $turbulence;

    div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p                 ;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
